# 3. Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и 3 литра
# и ги ползвате едновременно. Да се състави програма, която по въведен обем извежда
# как ще прелеете течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от кофите.

# Входни данни: естествено число от интервала [10..9999].
# Използвайте проверка на логическо условие - оператор if.
# Пример: 107 Изход: 21 пъти 2-те кофи, допълнително кофа от 2 литра


bucket_1_volume = 2
bucket_2_volume = 3

input_volume = 12
res = 0

if input_volume%(bucket_1_volume+bucket_2_volume)==0:
	res = input_volume//(bucket_1_volume+bucket_2_volume)
else:
	pass

print(res)
